app/controllers/charges_controller.rb

  def create

     # Creates a Stripe Customer object, for associating
     # with the charge
     customer = Stripe::Customer.create(
       email: current_user.email,
       card: params[:stripeToken]
     )

     # Where the real magic happens
     charge = Stripe::Charge.create(
       customer: customer.id, # Note -- this is NOT the user_id in your app
       amount: 1500,
       description: "Blocipedia Premium - #{current_user.email}",
       currency: 'usd'
     )

     current_user.update(role: 1)
---
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 1], ["updated_at", "2017-05-19 20:44:32.470384"], ["id", 16]]