app/controllers/collaborators_controller.rb

SELECT "collaborators".* FROM "collaborators"
---
  def index
    @collaborators = Collaborator.all