app/controllers/users_controller.rb

  def downgrade
    current_user.update_attributes(role: 0) # 0 is default standard role
---
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 0], ["updated_at", "2017-05-22 20:18:05.886898"], ["id", 16]]