app/controllers/wikis_controller.rb

SELECT "wikis".* FROM "wikis"
---
  def index
    @wikis = Wiki.all

INSERT INTO "wikis" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "TREEES"], ["body", "asldaslkdjasdlksja"], ["user_id", 17], ["created_at", "2017-06-05 22:25:44.146967"], ["updated_at", "2017-06-05 22:25:44.146967"]]
---
  def create
    @wiki = Wiki.new(wiki_params)

    if @wiki.save

UPDATE "wikis" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["title", "New Title"], ["body", "New Body"], ["updated_at", "2017-05-31 15:15:15.815160"], ["id", 2]]
---
  def update
    authorize @wiki
    if @wiki.update(wiki_params)

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 1]]
---
  def destroy
    @wiki = Wiki.find(params[:id])
    authorize @wiki
    @wiki.destroy

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_wiki
      @wiki = Wiki.find(params[:id])